```
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.external.git: Refreshing state... [id=-]
module.aws_organization.random_string.random: Refreshing state... [id=rVB1x]
module.serverless-example-api.module.repository.github_repository.repository: Refreshing state... [id=serverless-example-api]
module.aws_organization.aws_organizations_account.account: Refreshing state... [id=781149127351]
module.aws_logging.data.aws_partition.current: Refreshing state... [id=2020-08-14 03:17:10.764942813 +0000 UTC]
module.aws_logging.data.aws_caller_identity.current: Refreshing state... [id=2020-08-14 03:17:10.900959511 +0000 UTC]
module.api_gateway.aws_iam_role.api_gateway_cloudwatch: Refreshing state... [id=api-gateway-cloudwatch]
module.aws_logging.data.aws_iam_policy_document.bucket_policy: Refreshing state... [id=2003416470]
module.api_gateway.aws_api_gateway_account.account: Refreshing state... [id=api-gateway-account]
module.api_gateway.aws_iam_role_policy.api_gateway_cloudwatch: Refreshing state... [id=api-gateway-cloudwatch:default]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.aws_logging.aws_cloudtrail.cloudtrail will be created
  + resource "aws_cloudtrail" "cloudtrail" {
      + arn                           = (known after apply)
      + enable_log_file_validation    = true
      + enable_logging                = true
      + home_region                   = (known after apply)
      + id                            = (known after apply)
      + include_global_service_events = true
      + is_multi_region_trail         = true
      + is_organization_trail         = false
      + name                          = "cloudtrail"
      + s3_bucket_name                = "scaffoldly-rVB1x-logs"

      + event_selector {
          + include_management_events = true
          + read_write_type           = "All"

          + data_resource {
              + type   = "AWS::S3::Object"
              + values = [
                  + "arn:aws:s3:::",
                ]
            }
        }
      + event_selector {
          + include_management_events = true
          + read_write_type           = "All"

          + data_resource {
              + type   = "AWS::Lambda::Function"
              + values = [
                  + "arn:aws:lambda",
                ]
            }
        }
    }

  # module.aws_logging.aws_s3_bucket.logs will be created
  + resource "aws_s3_bucket" "logs" {
      + acceleration_status         = (known after apply)
      + acl                         = "log-delivery-write"
      + arn                         = (known after apply)
      + bucket                      = "scaffoldly-rVB1x-logs"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + lifecycle_rule {
          + enabled = true
          + id      = (known after apply)

          + noncurrent_version_transition {
              + days          = 180
              + storage_class = "DEEP_ARCHIVE"
            }
          + noncurrent_version_transition {
              + days          = 30
              + storage_class = "STANDARD_IA"
            }
          + noncurrent_version_transition {
              + days          = 60
              + storage_class = "GLACIER"
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }
    }

  # module.aws_logging.aws_s3_bucket_policy.bucket_policy will be created
  + resource "aws_s3_bucket_policy" "bucket_policy" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:PutObject"
                      + Condition = {
                          + StringEquals = {
                              + s3:x-amz-acl = "bucket-owner-full-control"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "delivery.logs.amazonaws.com",
                              + "cloudtrail.amazonaws.com",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::scaffoldly-rVB1x-logs/AWSLogs/781149127351/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:GetBucketAcl"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "delivery.logs.amazonaws.com",
                              + "cloudtrail.amazonaws.com",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::scaffoldly-rVB1x-logs"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

Plan: 3 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: planfile

To perform exactly these actions, run the following command to apply:
    terraform apply "planfile"

\n\n0
```